<?php

namespace Database\Seeders;

use App\Models\Region;
use App\Models\District;
use Illuminate\Database\Seeder;

class RegionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $regions = [
            'Ташкент',
            'Самарканд',
            'Бухара',
            'Наманган',
            'Фергана',
            'Андижан',
            'Сурхандарья',
            'Джизак',
            'Кашкадарья',
            'Навои',
            'Сырдарья',
            'Хорезм',
            'Каракалпакстан',
        ];

        $districts = [
            'Ташкент' => [
                'Алмазарский',
                'Бектемирский',
                'Мирабадский',
            ],
            'Самарканд' => [
                'Булунгурский',
                'Джамбайский',
                'Иштыханский',
            ],
            'Бухара' => [
                'Алмалыкский',
                'Бухарский',
                'Гиждуванский',
            ],
            'Наманган' => [
                'Чартакский',
                'Чустский',
                'Уйчинский',
            ],
            'Фергана' => [
                'Багдадский',
                'Буваидийский',
                'Дангаринский',
            ],
            'Андижан' => [
                'Андижанский',
                'Асакинский',
                'Балыкчинский',
            ],
            'Сурхандарья' => [
                'Ангорский',
                'Денауский',
                'Кизирикский',
            ],
            'Джизак' => [
                'Арнасайский',
                'Бахмальский',
                'Джизакский',
            ],
            'Кашкадарья' => [
                'Гузарский',
                'Камашинский',
                'Каршийский',
            ],
            'Навои' => [
                'Кизилтепинский',
                'Навбахорский',
                'Учкудукский',
            ],
            'Сырдарья' => [
                'Акалтинский',
                'Гулистанский',
                'Сайхунабадский',
            ],
            'Хорезм' => [
                'Багатский',
                'Гурленский',
                'Хазараспский',
            ],
            'Каракалпакстан' => [
                'Амударьинский',
                'Берунийский',
                'Кунградский',
            ],
        ];

        foreach ($regions as $regionName) {
            $region = Region::factory()->create(['name' => $regionName]);
            $districtsArray = $districts[$regionName] ?? [];
            foreach ($districtsArray as $district) {
                District::factory()->create(['name' => $district, 'region_id' => $region->id]);
            }
        }
    }
}
